#!/bin/bash

# Упражнение 1: Имя пользователя
#Напиши скрипт оболочки, который выводит имя твоего пользователя. Подсказка: используй команду echo с переменной среды USER.

# --- Упражнение 2: Текущая директория
#Напиши скрипт оболочки, который выводит твой текущий рабочий каталог. Подсказка: используй команду echo с переменной среды PWD.

# --- Упражнение 3: Домашний каталог
#Напиши скрипт оболочки, который выводит абсолютный путь к твоему домашнему каталогу. Подсказка: используй команду echo с переменной среды HOME.


# Упражнение 4: Версия ОС
#Напиши скрипт оболочки, который выводит значение файла "/etc/os-release". Подсказка: используй команду cat с именем файла.



# Упражнение 5: Uptime Напиши скрипт оболочки, который выводит результат команды uptime. Подсказка: просто исполни uptime в скрипте.



#Упражнение 6: Полная информация
